IS_DaemonAndSampler/Example/C/gcc_mpi_omp/cavity_OpenFOAM_vtk/system/blockMeshDict_mixcell
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


vertices
(
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 1)
    (1 0 1)
    (1 1 1)
    (0 1 1)
 
    (0 0 2)
    (1 0 2)
    (1 1 2)
    (0 1 2)
    (0 0 3)
    (1 0 3)
    (1 1 3)
    (0 1 3)

);

blocks
(
//    hex (0 1 2 3 4 5 5 4) (100 100 100) simpleGrading (1 1 1)   //prism
    hex (8 9 10 11 12 13 14 15) (200 100 100) simpleGrading (1 1 1) //hex
);

boundary
(
    fixedWalls
    {
        type wall;
        faces
        (
//            (0 4 4 3)
//            (2 5 5 1)
//            (1 5 4 0)
//            (3 4 5 2)
//            (0 3 2 1)
//            (4 5 5 4)

            (8 12 15 11)
            (10 14 13 9)
            (9 13 12 8)
            (11 15 14 10)
            (8 11 10 9)
            (12 13 14 15)
        );
    }

//    movingWall
//    {
//        type wall;
//        faces
//        (
//            (3 4 5 2)
//            (11 15 14 10)     
//        );
//
//    }
);
// ************************************************************************* //
